20220909135551-the_graph.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-01 Thu 10:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Graph</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">The Graph</h1>


<div id="outline-container-org80ddd3d" class="outline-2">
<h2 id="org80ddd3d">How the graph is built</h2>
<div class="outline-text-2" id="text-org80ddd3d">
<p>
The core elements are the <code>Op</code>\s. <code>Op</code>\s are objects that have different purposes in Aesara:
</p>

<ul class="org-ul">
<li><p>
<code>Op.make_node(*args, **kwargs)</code> instantiate <code>Apply</code> nodes, which refer to the <code>Op</code>, the <code>inputs</code> and <code>outputs</code> of the computation. The <code>aesara.compile.compile</code> function uses <code>Apply.inputs</code> and <code>Variable.owner</code> to determine which inputs are necessary to compute the function's outputs. For instance =RandomVariable=s:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #d73a49;">class</span> <span style="color: #005cc5;">RandomVariable</span>(Op):

    <span style="color: #d73a49;">def</span> <span style="color: #6f42c1;">make_node</span>(<span style="color: #d73a49;">self</span>, rng, size, dtype, *dist_params):
        <span style="color: #032f62;">"""Create a random variable node.</span>

<span style="color: #032f62;">        Parameters</span>
<span style="color: #032f62;">        ----------</span>
<span style="color: #032f62;">        rng: RandomGeneratorType or RandomStateType</span>
<span style="color: #032f62;">            Existing Aesara `Generator` or `RandomState` object to be used.  Creates a</span>
<span style="color: #032f62;">            new one, if `None`.</span>
<span style="color: #032f62;">        size: int or Sequence</span>
<span style="color: #032f62;">            NumPy-like size parameter.</span>
<span style="color: #032f62;">        dtype: str</span>
<span style="color: #032f62;">            The dtype of the sampled output.  If the value ``"floatX"`` is</span>
<span style="color: #032f62;">            given, then `dtype` is set to ``aesara.config.floatX``.  This value is</span>
<span style="color: #032f62;">            only used when ``self.dtype`` isn't set.</span>
<span style="color: #032f62;">        dist_params: list</span>
<span style="color: #032f62;">            Distribution parameters.</span>

<span style="color: #032f62;">        Results</span>
<span style="color: #032f62;">        -------</span>
<span style="color: #032f62;">        out: Apply</span>
<span style="color: #032f62;">            A node with inputs ``(rng, size, dtype) + dist_args`` and outputs</span>
<span style="color: #032f62;">            ``(rng_var, out_var)``.</span>

<span style="color: #032f62;">        """</span>
        <span style="color: #24292e;">size</span> = normalize_size_param(size)

        <span style="color: #24292e;">dist_params</span> = <span style="color: #d73a49;">tuple</span>(
            as_tensor_variable(p) <span style="color: #d73a49;">if</span> <span style="color: #d73a49;">not</span> <span style="color: #d73a49;">isinstance</span>(p, Variable) <span style="color: #d73a49;">else</span> p
            <span style="color: #d73a49;">for</span> p <span style="color: #d73a49;">in</span> dist_params
        )

        <span style="color: #d73a49;">if</span> rng <span style="color: #d73a49;">is</span> <span style="color: #005cc5;">None</span>:
            <span style="color: #24292e;">rng</span> = aesara.shared(np.random.default_rng())
        <span style="color: #d73a49;">elif</span> <span style="color: #d73a49;">not</span> <span style="color: #d73a49;">isinstance</span>(rng.<span style="color: #d73a49;">type</span>, RandomType):
            <span style="color: #d73a49;">raise</span> <span style="color: #005cc5;">TypeError</span>(
                <span style="color: #032f62;">"The type of rng should be an instance of either RandomGeneratorType or RandomStateType"</span>
            )

        <span style="color: #24292e;">shape</span> = <span style="color: #d73a49;">self</span>._infer_shape(size, dist_params)
        <span style="color: #24292e;">_</span>, <span style="color: #24292e;">bcast</span> = infer_broadcastable(shape)
        <span style="color: #24292e;">dtype</span> = <span style="color: #d73a49;">self</span>.dtype <span style="color: #d73a49;">or</span> dtype

        <span style="color: #d73a49;">if</span> dtype == <span style="color: #032f62;">"floatX"</span>:
            <span style="color: #24292e;">dtype</span> = config.floatX
        <span style="color: #d73a49;">elif</span> dtype <span style="color: #d73a49;">is</span> <span style="color: #005cc5;">None</span> <span style="color: #d73a49;">or</span> (<span style="color: #d73a49;">isinstance</span>(dtype, <span style="color: #d73a49;">str</span>) <span style="color: #d73a49;">and</span> dtype <span style="color: #d73a49;">not</span> <span style="color: #d73a49;">in</span> all_dtypes):
            <span style="color: #d73a49;">raise</span> <span style="color: #005cc5;">TypeError</span>(<span style="color: #032f62;">"dtype is unspecified"</span>)

        <span style="color: #d73a49;">if</span> <span style="color: #d73a49;">isinstance</span>(dtype, <span style="color: #d73a49;">str</span>):
            <span style="color: #24292e;">dtype_idx</span> = constant(all_dtypes.index(dtype), dtype=<span style="color: #032f62;">"int64"</span>)
        <span style="color: #d73a49;">else</span>:
            <span style="color: #24292e;">dtype_idx</span> = constant(dtype, dtype=<span style="color: #032f62;">"int64"</span>)
            <span style="color: #24292e;">dtype</span> = all_dtypes[dtype_idx.data]

        <span style="color: #24292e;">outtype</span> = TensorType(dtype=dtype, shape=bcast)
        <span style="color: #24292e;">out_var</span> = outtype()
        <span style="color: #24292e;">inputs</span> = (rng, size, dtype_idx) + dist_params
        <span style="color: #24292e;">outputs</span> = (rng.<span style="color: #d73a49;">type</span>(), out_var)

        <span style="color: #d73a49;">return</span> Apply(<span style="color: #d73a49;">self</span>, inputs, outputs)

</pre>
</div></li>

<li><code>Op.__call__</code> defers to <code>Op.make_node</code> to create the <code>Apply</code> node and <i>then</i> is responsible for returning the output variables.</li>
</ul>

<p>
There is a subtility here in that <code>__call__</code> does not need to return <i>all</i> the output variables. Indeed, some may be needed for computation in <code>Op.perform</code> (of equivalent) but do not need to be <i>exposed</i> to those who build the graph. Random Variables come to mind, where the <code>__call__</code> function can be:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #d73a49;">class</span> <span style="color: #005cc5;">RandomVariable</span>(Op):

    <span style="color: #d73a49;">def</span> <span style="color: #6f42c1;">__call__</span>(<span style="color: #d73a49;">self</span>, *inputs: Any, **kwargs) -&gt; Union[Variable, List[Variable]]:
        <span style="color: #24292e;">node</span> = <span style="color: #d73a49;">self</span>.make_node(*inputs, **kwargs)
        <span style="color: #24292e;">rval</span> = node.outputs[1]
        <span style="color: #d73a49;">return</span> rval
</pre>
</div>

<p>
You then have single output <code>Op</code>\s, for which Aesara returns a single element instead of a one-item list:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #d73a49;">class</span> <span style="color: #005cc5;">SingleOutputOp</span>(Op):
    <span style="color: #d73a49;">def</span> <span style="color: #6f42c1;">__call__</span>(<span style="color: #d73a49;">self</span>, *inputs: Any, **kwargs) -&gt; Union[Variable, List[Variable]]:
        <span style="color: #24292e;">node</span> = <span style="color: #d73a49;">self</span>.make_node(*inputs, **kwargs)
        <span style="color: #24292e;">rval</span> = node.outputs[0]
        <span style="color: #d73a49;">return</span> rval
</pre>
</div>

<p>
And <code>MultipleOutputOp</code>\s for which Aesara returns the list of outputs:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #d73a49;">class</span> <span style="color: #005cc5;">SingleOutputOp</span>(Op):
    <span style="color: #d73a49;">def</span> <span style="color: #6f42c1;">__call__</span>(<span style="color: #d73a49;">self</span>, *inputs: Any, **kwargs) -&gt; Union[Variable, List[Variable]]:
        <span style="color: #24292e;">node</span> = <span style="color: #d73a49;">self</span>.make_node(*inputs, **kwargs)
        <span style="color: #d73a49;">return</span> node.outputs
</pre>
</div>

<p>
A first issue with this is conceptual: it is all in the code (in <code>__call__</code>) and that the selection of multiple outputs is not part of the intermediate representation, the graph. And this conceptual issue creates other issues downstream. For instance when trying to get a etuple-representation of the graph. We can work at the level of the <code>Apply</code> node so that the etuplization of the following:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #24292e;">z_rv</span> = at.random.normal(0, 1)
</pre>
</div>

<p>
gives
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #24292e;">z_et</span> = OpExpressionTuple(ExpressionTuple(RandomVariable, name, ndim_supp, ndim_params, dtype), rng, size, dtype, *dist_params)
</pre>
</div>

<p>
which when evaluated returns the outputs:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #24292e;">z_rv</span> = z_et.evaled_obj
</pre>
</div>

<p>
But that requires to write custom code for each "special case" where <code>default_output</code> is different from 1. However, we would like the <code>etuplization</code> code to remain general so we can easily unify down the line.
</p>

<p>
Even worse are <code>MultipleOutputOp</code>\s
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #d73a49;">import</span> aesara.tensor <span style="color: #d73a49;">as</span> at
<span style="color: #d73a49;">from</span> etuples <span style="color: #d73a49;">import</span> etuple, etuplize

<span style="color: #24292e;">a</span> = at.matrix(<span style="color: #032f62;">'a'</span>)
<span style="color: #24292e;">u</span>, <span style="color: #24292e;">v</span>, <span style="color: #24292e;">w</span> = at.nlinalg.svd(a)
<span style="color: #24292e;">u_et</span> = etuplize(u)
<span style="color: #d73a49;">print</span>(u_et)

<span style="color: #6a737d;"># </span><span style="color: #6a737d;">reset the saved evaled obj</span>
<span style="color: #24292e;">u_et._evaled_obj</span> = u_et.null
<span style="color: #d73a49;">print</span>(u_et.evaled_obj)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #d73a49;">import</span> aesara.tensor <span style="color: #d73a49;">as</span> at
<span style="color: #d73a49;">from</span> etuples <span style="color: #d73a49;">import</span> etuple, etuplize

<span style="color: #24292e;">u_rv</span> = at.random.normal(0, 1)
<span style="color: #24292e;">u_et</span> = etuplize(u_rv)
<span style="color: #d73a49;">print</span>(u_et)

<span style="color: #6a737d;"># </span><span style="color: #6a737d;">reset the saved evaled obj</span>
<span style="color: #24292e;">u_et._evaled_obj</span> = u_et.null
<span style="color: #d73a49;">print</span>(u_et.evaled_obj)
</pre>
</div>


<p>
<code>__call__</code> can also be used when we want an API that is slightly different that the API in the <code>perform</code> functions (also the case with some RVs), which must correspond to the order of the inputs in the graph.
</p>


<ul class="org-ul">
<li>A <code>Linker</code> uses the <code>Op</code> associated with the <code>Apply</code> node to compute the numeric values for the output variables. Linkers will ask for a function that converts the <code>Op</code> into a callable.</li>
<li><code>Op.perform</code> is the Python implementation of the <code>Op</code>. It takes the numeric values of the inputs and returns the computed numeric values of the outputs. It is useful for debugging.</li>
<li><code>COp.c_code</code> is the C implementation of the <code>Op</code>. <b><b>Why don't we have everything in the C Linker?</b></b></li>
</ul>

<div class="org-src-container">
<pre class="src src-python">
</pre>
</div>

<p>
This class is typically instantiated by a `Op.make<sub>node</sub>` method, which
is called by `Op._<sub>call</sub>__`.
</p>

<p>
The function `aesara.compile.function.function` uses `Apply.inputs`
together with `Variable.owner` to search the expression graph and determine
which inputs are necessary to compute the function's outputs.
</p>

<p>
A `Linker` uses the `Apply` instance's `op` field to compute numeric values
for the output variables.
</p>
</div>
</div>

<div id="outline-container-org4ebe1b5" class="outline-2">
<h2 id="org4ebe1b5">Links to this note</h2>
</div>
</div>
</body>
</html>